Revit 2027 API
TransformWithBoundary Methods
The TransformWithBoundary type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundary |  Returns the boundary for the model space to view projection space transform.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetModelToProjectionTransform |  Gets the model space to view projection space transform.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TransformWithBoundary Class
Autodesk.Revit.DB Namespace